import type { 奇穴列表数据类型 } from '@/@types/奇穴'

/**
 * @name 奇穴数据 - 问水诀
 */

const 奇穴数据: 奇穴列表数据类型[] = [
  // 第一层奇穴
  {
    奇穴列表: [
      {
        奇穴名称: '听晓',
        奇穴图片: 'https://icon.jx3box.com/icon/17160.png',
        id: '30777',
        奇穴描述:
          '每秒恢复5点剑气，"莺鸣柳"不再充能和恢复剑气，调息时间降低45秒，"莺鸣"持续期间内首次剑气达到上限时自身无双等级提高50%，并延长15秒。',
      },
      {
        奇穴名称: '无锋',
        奇穴图片: 'https://icon.jx3box.com/icon/13381.png',
        id: '42179',
        奇穴描述:
          '完整运功"夕照雷峰"，完整运功"云飞玉皇","鹤归孤山"成功命中目标给自身分别添加1、2、3层[重剑无锋]气劲。',
      },
      {
        奇穴名称: '霞流宝石',
        奇穴图片: 'https://icon.jx3box.com/icon/2373.png',
        id: '1610',
        奇穴描述:
          '立即对周围6尺内的最多10个目标均造成点外功伤害并卸除其阳性、混元性、阴性、毒性气劲各一个，附加额外100%武器伤害，并使其4.5秒内无法使用武器。',
      },
      {
        奇穴名称: '叠锋意',
        奇穴图片: 'https://icon.jx3box.com/icon/24451.png',
        id: '40178',
        奇穴描述:
          '"莺鸣柳"调息时间降低65秒，增益效果替换为外功会心提高10%，可突破上限的外功会心效果提高25%。每施展招式消耗剑气造成伤害时，"莺鸣柳"调息时间降低1.5秒，3秒内连续施展"莺鸣柳"获得的增益可叠加。',
      },
    ],
  },
  // 第二层奇穴
  {
    奇穴列表: [
      {
        奇穴名称: '莺语',
        奇穴图片: 'https://icon.jx3box.com/icon/19156.png',
        id: '21737',
        奇穴描述:
          '"梦泉虎跑"每次命中目标则在目标位置生成剑魂，最多5个存在12秒，山居剑意下施展"云飞玉皇"命中目标可引发剑魂共鸣延迟攻击目标，每把造成100%武器伤害附带点外功伤害并降低"莺鸣柳"1秒调息时间。',
      },
      {
        奇穴名称: '云体',
        奇穴图片: 'https://icon.jx3box.com/icon/2387.png',
        id: '6544',
        奇穴描述: '"梦泉虎跑"期间减伤效果提高35%，施展"听雷"可以额外造成外功伤害。',
      },
      {
        奇穴名称: '怜光',
        奇穴图片: 'https://icon.jx3box.com/icon/2917.png',
        id: '5957',
        奇穴描述: '"梦泉虎跑"不再附带减伤效果，"山居剑意"下所有招式伤害提高10% 。',
      },
      {
        奇穴名称: '宜秋',
        奇穴图片: 'https://icon.jx3box.com/icon/2370.png',
        id: '42218',
        奇穴描述: '"云飞玉皇"伤害提高10%，完整运功"云飞玉皇"直接造成最大伤害。',
      },
    ],
  },
  // 第三层奇穴
  {
    奇穴列表: [
      {
        奇穴名称: '层云',
        奇穴图片: 'https://icon.jx3box.com/icon/2911.png',
        id: '6545',
        奇穴描述:
          '"风来吴山"伤害每跳递增10%，最多递增5次。施展期间，无需自身旋转，而是使剑芒在自身当前位置维持，并可以通过"峰插云景"击退自身和敌对的剑芒。',
      },
      {
        奇穴名称: '逍遥',
        奇穴图片: 'https://icon.jx3box.com/icon/12721.png',
        id: '23922',
        奇穴描述:
          '自身控制招式持续效果（减速除外）提高1秒，若成功控制目标则武器伤害提高40%，基础外功攻击提高5%，持续10秒最多强化2次。',
      },
      {
        奇穴名称: '山色',
        奇穴图片: 'https://icon.jx3box.com/icon/11877.png',
        id: '5956',
        奇穴描述:
          '"风来吴山"伤害提高25%，变为2层透支招式，透支充能时间1分15秒，持续时间降低1.5秒，只能攻击3个目标，攻击频率提高33%。',
      },
      {
        奇穴名称: '景行',
        奇穴图片: 'https://icon.jx3box.com/icon/9532.png',
        id: '18682',
        奇穴描述:
          '"九溪弥烟"调息时间增加至24秒，施展"九溪弥烟"后立即造成（0.8*破招系数*破招值）点破招伤害并在原地产生4尺"剑泽"效果，"剑泽"内敌对目标移动速度降低80%，持续过程中每1秒对范围内的5个目标造成伤害，持续24秒。',
      },
    ],
  },
  // 第四层奇穴
  {
    奇穴列表: [
      {
        奇穴名称: '剑锋百锻',
        奇穴图片: 'https://icon.jx3box.com/icon/13376.png',
        id: '29093',
        奇穴描述:
          '运功3秒，运功期间免疫一切负面效果，使自身以及10尺内2个小队成员获得"百锻"持续60秒，"百锻"期间破防值提高，若已有该效果，则它将获得强化，最多2次，"百锻"期间，对侠士造成伤害或重伤都会延长时间最多延长至5分钟。',
      },
      {
        奇穴名称: '山岳乘风',
        奇穴图片: 'https://icon.jx3box.com/icon/20066.png',
        id: '36274',
        奇穴描述:
          '山居剑意下可施展，最多蓄力3秒，期间自身移动速度降低50%并完全抵挡受到的内外功伤害。每蓄力0.5秒回复10点剑气，蓄力后释放反击招式对前方8尺最多5个敌方目标造成最多外功伤害附带200%武器伤害，蓄力1.5至2.5秒期间释放则继续发动旋风般的重剑攻击（伤害视作"风来吴山"），持续2.5秒。',
      },
      {
        奇穴名称: '岱宗',
        奇穴图片: 'https://icon.jx3box.com/icon/11872.png',
        id: '5952',
        奇穴描述:
          '"云飞玉皇"可移动施展，命中非侠士目标后使自身获得一层"岱宗"效果：每层使自身会心效果提高8%，持续15秒，最多可叠加3层。',
      },
      {
        奇穴名称: '惊涛',
        奇穴图片: 'https://icon.jx3box.com/icon/2365.png',
        id: '1647',
        奇穴描述:
          '消耗10点剑气，对其造成点外功伤害，附加额外200%武器伤害，并使目标移动速度降低50%，持续12秒。"山居剑意"下施展使目标定身3秒。',
      },
    ],
  },
  // 第五层奇穴
  {
    奇穴列表: [
      {
        奇穴名称: '摘星',
        奇穴图片: 'https://icon.jx3box.com/icon/2591.png',
        id: '18309',
        奇穴描述:
          '"平湖断月"可以在基础调息时间中施展，施展距离提高5尺，命中运功中的目标使其眩晕3秒。',
      },
      {
        奇穴名称: '残雪',
        奇穴图片: 'https://icon.jx3box.com/icon/2389.png',
        id: '6549',
        奇穴描述: '"莺鸣"持续期间额外提高自身15%基础外功攻击。',
      },
      {
        奇穴名称: '凭风',
        奇穴图片: 'https://icon.jx3box.com/icon/7206.png',
        id: '14604',
        奇穴描述:
          '"问水诀"下施展"啸日"，每秒回复3%气血最大值，持续8秒。"山居剑意"下施展"啸日"，自身身法提高30%，持续15秒，该气劲只可在"问水诀"心法下维持。',
      },
      {
        奇穴名称: '云台',
        奇穴图片: 'https://icon.jx3box.com/icon/11874.png',
        id: '18326',
        奇穴描述:
          '施展招式"鹤归孤山"后5秒内自身身法提高10%且每点身法化解30点伤害，当周围30尺敌对玩家人数大于等于6人时，每点身法化解120点伤害；命中目标则击倒3秒。',
      },
    ],
  },
  // 第六层奇穴
  {
    奇穴列表: [
      {
        奇穴名称: '映波锁澜',
        奇穴图片: 'https://icon.jx3box.com/icon/2913.png',
        id: '5959',
        奇穴描述:
          '"听雷"伤害提高10%，命中目标后使自身下两次"夕照雷峰""云飞玉皇"会心几率及招式伤害提高15%。',
      },
      {
        奇穴名称: '冰天',
        奇穴图片: 'https://icon.jx3box.com/icon/4535.png',
        id: '28578',
        奇穴描述:
          '自身闪避后，可为自身添加一层"冰天"效果，最多三层，持续12秒。效果期间自身若触发"断潮"则消耗一层"冰天"并使得"断潮"伤害额外提高100%。',
      },
      {
        奇穴名称: '造化',
        奇穴图片: 'https://icon.jx3box.com/icon/2914.png',
        id: '5964',
        奇穴描述:
          '战斗状态下自身剑气高于50点施展"夕照雷峰""云飞玉皇"，剑气消耗降低2点，招式伤害提高10%。若剑气高于75点施展"夕照雷峰""云飞玉皇"，则招式伤害提高至15%。',
      },
      {
        奇穴名称: '气爽',
        奇穴图片: 'https://icon.jx3box.com/icon/4550.png',
        id: '6541',
        奇穴描述: '"泉凝月"每点身法化解的伤害提升70%。',
      },
    ],
  },
  // 第七层奇穴
  {
    奇穴列表: [
      {
        奇穴名称: '山重水复',
        奇穴图片: 'https://icon.jx3box.com/icon/2375.png',
        id: '6542',
        奇穴描述:
          '在地面施展"风来吴山"时，每命中一个目标减少5秒调息时间并恢复自身3%气血最大值，该效果最多作用6次。若施展时周围20尺内敌对侠士目标少于等于5人，该效果可额外作用4次。',
      },
      {
        奇穴名称: '雾锁',
        奇穴图片: 'https://icon.jx3box.com/icon/4577.png',
        id: '6534',
        奇穴描述: '"夕照雷峰"命中目标使自身无视目标45%外功防御等级，持续15秒。',
      },
      {
        奇穴名称: '松舍问霞',
        奇穴图片: 'https://icon.jx3box.com/icon/7502.png',
        id: '14910',
        奇穴描述:
          '重击20尺内的敌对目标，对其造成200%武器伤害外加点外功伤害，30%几率附带"断潮"效果，每1%会心会提高1%断潮触发几率。若目标距离自身8尺外则附带冲刺效果，命中高度高于8尺的目标时，造成伤害提高30%并将其直接击落，使其击倒4秒，若成功击落目标，可在3秒内施展"松舍问霞·跃"追击攻击目标。',
      },
      {
        奇穴名称: '剑引龙泉',
        奇穴图片: 'https://icon.jx3box.com/icon/13377.png',
        id: '32776',
        奇穴描述:
          '被动：[重剑无锋]可叠至20层。主动：运功1.25秒（期间免疫打断运功效果），对前方20尺内目标进行重击造成两段200%武器伤害附加点外功伤害并为自身添加1层[重剑无锋]。若目标距离自身8尺外则附带冲刺效果。',
      },
    ],
  },
  // 第八层（混池）
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '撼岳',
        奇穴图片: 'https://icon.jx3box.com/icon/16192.png',
        id: '29090',
        奇穴描述:
          '"听雷"会心几率提高10%，会心效果提高10%， 命中目标后，使目标获得"惊雷"效果：每次受到添加者的"风来吴山"伤害则会触发一道惊雷受到点外功伤害，持续10秒。',
      },
      {
        奇穴名称: '危峦',
        奇穴图片: 'https://icon.jx3box.com/icon/17206.png',
        id: '30772',
        奇穴描述: '"峰插云景"不再消耗剑气，造成的封轻功效果提高2秒，击退目标后使其锁足4秒。',
      },
      {
        奇穴名称: '长晖',
        奇穴图片: 'https://icon.jx3box.com/icon/23456.png',
        id: '38674',
        奇穴描述: '"夕照雷峰"施展距离提高2尺，若目标在4尺外12尺内则附带冲刺效果。',
      },
      {
        奇穴名称: '山倾',
        奇穴图片: 'https://icon.jx3box.com/icon/17205.png',
        id: '30862',
        奇穴描述:
          '"鹤归孤山"伤害扩散结束后会生成一个半径10尺的"九皋鹤野"区域，持续7秒，在区域内施展"夕照雷峰""云飞玉皇"会形成落剑造成点外功伤害附加200%武器伤害并降低2秒"云飞玉皇"调息时间最多触发5次。',
      },
      {
        奇穴名称: '碧归',
        奇穴图片: 'https://icon.jx3box.com/icon/4568.png',
        id: '6548',
        奇穴描述:
          '"风来吴山"不再消耗剑气，每命中一个目标回复5点剑气并使目标移动速度降低30%，持续5秒。该效果每累计回复10点剑气，可使下一次施展其余"灵峰剑式"伤害提高30%，该效果最多叠加4层，持续9秒。',
      },
      {
        奇穴名称: '片玉',
        奇穴图片: 'https://icon.jx3box.com/icon/7239.png',
        id: '14607',
        奇穴描述:
          '受到攻击导致自身气血值低于1%，立刻回复40%气血，并重置"泉凝月"，该效果最多150秒触发一次。',
      },
      {
        奇穴名称: '风吹荷',
        奇穴图片: 'https://icon.jx3box.com/icon/2390.png',
        id: '1665',
        奇穴描述:
          '强制目标攻击自身，并使自身获得3层持续3秒的"风吹荷"效果：外功闪避几率提高100%，闪避1次攻击后消失（每0.5秒最多消失1层）。',
      },
      {
        奇穴名称: '岫烟',
        奇穴图片: 'https://icon.jx3box.com/icon/14077.png',
        id: '25017',
        奇穴描述: '对定身、眩晕、击倒的目标造成伤害提高30%。',
      },
      {
        奇穴名称: '如风',
        奇穴图片: 'https://icon.jx3box.com/icon/7419.png',
        id: '14605',
        奇穴描述:
          '"啸日"不再解除控制，调息时间以及附带"啸日"气劲降低50%，施展"啸日"使自身加速率提高8%，威胁值降低10%，持续10秒，且任何外功招式会心都会使该效果持续时间延长5秒。',
      },
      {
        奇穴名称: '浮云',
        奇穴图片: 'https://icon.jx3box.com/icon/2374.png',
        id: '5963',
        奇穴描述:
          '"风来吴山"连续命中目标4次后或"云飞玉皇"命中目标，使目标获得一层持续8秒的6%的治疗吸收盾最多8层。',
      },
      {
        奇穴名称: '探梅',
        奇穴图片: 'https://icon.jx3box.com/icon/2367.png',
        id: '1655',
        奇穴描述:
          '若目标为队友，解除其受到的控制效果（击倒除外）并使其3秒内免疫控制效果，且获得化解自身最大气血值25%伤害的护盾，同时目标和自身移动速度提高20%，持续10秒，若目标为敌人，则对目标的目标施展。',
      },
      {
        奇穴名称: '斩岳',
        奇穴图片: 'https://icon.jx3box.com/icon/4496.png',
        id: '6537',
        奇穴描述: '"峰插云景"成功命中目标则立刻重置"云飞玉皇""鹤归孤山"调息时间。',
      },
    ],
  },
]

export default 奇穴数据
