const 默认问水图标 = 'https://img.jx3box.com/image/xf/10144.png'

const 技能图标ID: Record<string, number> = {
  莺鸣柳: 2388,
  啸日: 2369,
  听雷: 2363,
  '听雷-轻': 2363,
  '听雷-重': 2363,
  黄龙吐翠: 2386,
  平湖断月: 2383,
  九溪弥烟: 2384,
  '九溪弥烟-轻': 2384,
  夕照雷峰: 2372,
  云飞玉皇: 2370,
  '云飞玉皇·二段': 2370,
  '云景·云飞玉皇': 2370,
  鹤归孤山: 2371,
  '鹤归孤山·山倾': 2371,
  风来吴山: 2375,
  峰插云景: 2374,
}

export const 获取默认问水图标 = () => 默认问水图标

export const 技能图标地址 = (技能名称: string) =>
  技能图标ID[技能名称] ? `https://icon.jx3box.com/icon/${技能图标ID[技能名称]}.png` : 默认问水图标
