import { 副本精简特效枚举, 装备信息数据类型, 装备增益类型, 装备特效枚举 } from '@/@types/装备'
import 获取当前数据 from '@/数据/数据工具/获取当前数据'
import { 获取副本特效增益表现 } from './装备特效判断'

const 副本精简叠加特效 = [
  装备特效枚举.特效_40802,
  装备特效枚举.特效_40803,
  装备特效枚举.特效_40804,
  装备特效枚举.特效_41065,
]
const 副本精简单件特效 = [装备特效枚举.特效_40788]

export const 补齐装备特效等级 = (装备信息: 装备信息数据类型): 装备增益类型 => {
  const { 装备数据 } = 获取当前数据()
  const 装备增益: 装备增益类型 = { ...装备信息?.装备增益 }
  const 副本精简等级列表 = {}

  装备信息?.装备列表?.forEach((装备) => {
    const 该装备属性 = 装备数据?.[装备?.装备部位]?.find((item) => item?.id === 装备?.id)
    const 装备特效 = 该装备属性?.装备特效
    if (!装备特效) {
      return
    }

    if (装备特效 === 装备特效枚举.风特效腰坠) {
      装备增益.风特效腰坠_实际等级 = 获取风腰实际等级(该装备属性?.装备品级)
    }

    if (副本精简单件特效.includes(装备特效) && 副本精简特效枚举?.[装备特效]) {
      装备增益[装备特效] = 获取副本特效增益表现(该装备属性?.装备品级, 该装备属性?.特效等级)
    }

    if (副本精简叠加特效.includes(装备特效) && 副本精简特效枚举?.[装备特效]) {
      副本精简等级列表[装备特效] = (副本精简等级列表[装备特效] || []).concat(
        获取副本特效增益表现(该装备属性?.装备品级, 该装备属性?.特效等级),
      )
    }
  })

  Object.keys(副本精简等级列表).forEach((装备特效) => {
    装备增益[`${装备特效}_等级列表`] = 副本精简等级列表[装备特效]
  })

  return 装备增益
}

const 获取风腰实际等级 = (装备品级?: number) => {
  return 装备品级 && 装备品级 >= 37900 ? 2 : 1
}

export default 补齐装备特效等级
