/**
 * @name 默认配装
 * @description 来自「藏剑配装计算器暗影千机测试版ver1.1(202605212040).xlsx」当前配装器面板。
 */

const 默认配装 = {
  装备基础属性: {
    基础攻击: 69237,
    破防等级: 98191,
    无双等级: 70991,
    会心等级: 129620,
    会心效果等级: 13632,
    全能等级: 0,
    武器伤害_最小值: 5862,
    武器伤害_最大值: 9770,
    破招值: 92028,
    力道: 361,
    元气: 44,
    身法: 10684,
    根骨: 44,
    体质: 218067,
    基础气血上限: 112978,
    额外气血上限: 0,
    加速等级: 7203,
    装分: 377994,
  },
  装备镶嵌附魔属性: {
    基础攻击: 0,
    破防等级: 0,
    无双等级: 0,
    会心等级: 0,
    会心效果等级: 0,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    破招值: 0,
    力道: 0,
    元气: 0,
    身法: 0,
    根骨: 0,
    体质: 0,
    基础气血上限: 0,
    额外气血上限: 0,
    加速等级: 0,
  },
  装备列表: [],
  五彩石: '彩·斩铁·锐刃·无双(陆)',
  装备增益: {},
}

export default 默认配装
